<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.03 [fr] (Win95; I) [Netscape]">
</HEAD>
<BODY TEXT="#000000" BGCOLOR="#FFFFFF" LINK="#0000EF" VLINK="#000080" ALINK="#FF0000">

<CENTER>
<H1>
Introduction</H1></CENTER>
<B><U><FONT SIZE=+2>1/ Pr&eacute;sentation</FONT></U></B>

<P><FONT SIZE=+1>La 3D est depuis longtemps tr&egrave;s largement utilis&eacute;e
en informatique, et les exemples d'applications ne manquent pas. Mais pour
nombre de programmeurs, faire de la 3D rel&egrave;ve encore du myst&egrave;re.
On trouve de plus en plus de jeunes programmeurs, qui ne disposent pas
des bases math&eacute;matiques n&eacute;cessaires &agrave; leur apprentissage.
Il est certes assez facile de trouver de la documentation dans les nombreux
ouvrages traitant de ce sujet, et les sites internet qui y sont consacr&eacute;s
sont en croissance exponentielle. Seulement, l'anglais &eacute;tant le
langage du web, il est assez difficile de trouver une bonne documentation
en fran&ccedil;ais traitant de ce sujet. Il est &eacute;galement utopique
d'esp&eacute;rer trouver le moindre tutoriel, m&ecirc;me en anglais, vous
expliquant de long en large comment r&eacute;aliser une animation en 3D
a partir de vos simples connaissances en mati&egrave;re de programmation.</FONT>

<P><FONT SIZE=+1>C'est pourquoi j'ai d&eacute;cid&eacute; de m'atteler
&agrave; la tache, et des r&eacute;aliser pour mes amis francophones un
ensemble de tutoriaux, qui vous permettront de d&eacute;couvrir les principes
des transformations 3D et leur application, ainsi que diff&eacute;rents
mod&egrave;les d'&eacute;clairage tels qu'ils sont employ&eacute;s dans
le domaine des d&eacute;mos.</FONT>

<P><B><U><FONT SIZE=+2>2/ Avertissement</FONT></U></B>

<P><FONT SIZE=+1>Les algorithmes qui sont pr&eacute;sent&eacute;s ici sont
des versions simplifi&eacute;es et non optimis&eacute;es, le but &eacute;tant
principalement p&eacute;dagogique. Il est &eacute;vident qu'il existe des
m&eacute;thodes bien meilleures, tant en mati&egrave;re de performances
que de pr&eacute;cision. Vous serez donc libre d'optimiser selon votre
go&ucirc;t les exemples que je vous propose.</FONT>

<P><FONT SIZE=+1>Vous &ecirc;tes totalement libre d'utiliser les sources
fournies ici dans vos propres programmes, &agrave; but NON COMMERCIAL,
et de les modifier a votre gr&eacute;. Si vous distribuez des r&eacute;alisations
et que mon aide vous a &eacute;t&eacute; utile, merci de me remercier dans
la documentation accompagnant votre programme (&ccedil;a ne co&ucirc;te
rien, et &ccedil;a me fera plaisir) : je saurais comme &ccedil;a que mon
travail n'a pas &eacute;t&eacute; totalement inutile.</FONT>

<P><B><U><FONT SIZE=+2>3/ A propos des compilateurs</FONT></U></B>

<P><FONT SIZE=+1>Les programmes pr&eacute;sent&eacute;s sont pour la plupart
&eacute;crit en C et compil&eacute;s avec le Watcom 10.0. Cependant, vous
pouvez adapter ce code &agrave; tout type de compilateur et &agrave; toute
machine, puisqu'il a &eacute;t&eacute; r&eacute;alis&eacute; dans un soucis
de portabilit&eacute;.</FONT>

<P>
<HR WIDTH="100%">

<P><FONT SIZE=+1><A HREF="Plan3D.html">[Sommaire]</A> <A HREF="Plan3D.html">[Pr&eacute;c&eacute;dent]</A>
<A HREF="chap2.html">[Suivant]</A> <A HREF="../accueil.html" TARGET="Contenu">[Home
Page]</A></FONT>

<P><FONT SIZE=+1>Page r&eacute;alis&eacute;e par <A HREF="../cv.html" TARGET="Contenu">Christophe
Heulin.</A></FONT>
<BR><FONT SIZE=+1>Renseignements, critiques, informations : <A HREF="mailto:heulin@multimania.com">heulin@multimania.com</A></FONT>
</BODY>
</HTML>
